const 南方中评全指证券有效交易 = [

];
//交易说明:
/* 
[
  {
    确认时间: "2022-02-16", //买的时间;
    无手续费天数: 7, //无手续费要经过的时间;

    买入金额: 1000, //购入时总金额;
    确认份额: 913.65, //购入时总份额;
    确认净值: 1.0945, //购入时单位成本;

    勾兑金额: 0, //卖出时总金额; 0表示没卖出对应份额;
    勾兑份额: 0, //卖出时总份额; 0表示没卖出对应份额;
    勾兑净值: 0, //卖出时单位成本; 0表示没卖出对应份额;
    勾兑日期: "", //卖出时间; 空字符串表示没卖出;
    勾兑盈利: 0, //卖出与买入的对比; 0表示没卖出;
  },
]

*/


//做波段高频无手续费交易:
//如果`当天净值`高于最低净值,并且其它的份额中`最低净值对应的确认份额`也过了`无手续费天数`;可以直接买出`最低净值对应的确认份额`,并标注那一份最低的确认份额对应卖出;
//之后在`最低净值对应的勾兑净值`标注为`当天净值`;在后面如果`当天净值`高于`最低净值对应的勾兑净值`时,可以买入;(中间的差值就表示自己赚了多少);
//前提:每一次的买入都代表自己认为长期时,净值一定会超过此时买入的净值;
//结论:也就是在说在`每一天的当天净值`位于[`最低净值对应的勾兑净值`,`第二低净值`]时,不可买入和卖出,因为这代表上次交易出错了(不过短期内不代表亏损,长期来看才是亏本的),此时最好就是等时间;

const 南方中评全指证券已勾兑交易 = [
  /* {
    确认时间: "2022-04-28",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1117.44,
    确认净值: 0.8949,

    勾兑金额: 1010,
    勾兑份额: 1117,
    勾兑净值: 0.9043,
    勾兑日期: "2022-05-13",
    勾兑盈利: 10,
  }, */
  /* {
    确认时间: "2022-04-29",
    无手续费天数: 7,

    买入金额: 2000,
    确认份额: 2281.8,
    确认净值: 0.8765,

    勾兑金额: 2036.25,
    勾兑份额: 2281,
    勾兑净值: 0.8927,
    勾兑日期: "2022-05-10",
    勾兑盈利: 36,
  }, */
  /* {
    确认时间: "2022-05-16",
    无手续费天数: 7,

    买入金额: 1010,
    确认份额: 1126.48,
    确认净值: 0.8966,

    勾兑金额: 1017,
    勾兑份额: 1126,
    勾兑净值: 0.9037,
    勾兑日期: "2022-05-18",
    勾兑盈利: 7,
  }, */
  /* {
    确认时间: "2022-05-20",
    无手续费天数: 7,

    买入金额: 1500,
    确认份额: 1664.08,
    确认净值: 0.9014,

    勾兑金额: 1525,
    勾兑份额: 1664,
    勾兑净值: 0.9167,
    勾兑日期: "2022-05-20",
    勾兑盈利: 25,
  }, */
  /* {
    确认时间: "2022-05-25",
    无手续费天数: 7,

    买入金额: 2500,
    确认份额: 2793.30,
    确认净值: 0.8950,

    勾兑金额: [1028,1531],
    勾兑份额: [1126,1667],
    勾兑净值: [0.9137,0.9186],
    勾兑日期: ["2022-05-26","2022-06-01"],
    勾兑盈利: [0,59],
  }, */
  /* {
    确认时间: "2022-05-30",
    无手续费天数: 7,

    买入金额: 1020,
    确认份额: 1119.77,
    确认净值: 0.9109,

    勾兑金额: 1027,
    勾兑份额: 1119,
    勾兑净值: 0.9186,
    勾兑日期: "2022-06-01",
    勾兑盈利: 7,
  }, */
  /* {
    确认时间: "2022-05-31",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1102.90,
    确认净值: 0.9067,

    勾兑金额: 1014,
    勾兑份额: 1102,
    勾兑净值: 0.9207,
    勾兑日期: "2022-06-02",
    勾兑盈利: 14,
  }, */
  /* {
    确认时间: "2022-06-09",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1046.13,
    确认净值: 0.9559,

    勾兑金额: 1024,
    勾兑份额: 1046,
    勾兑净值: 0.9797,
    勾兑日期: "2022-06-10",
    勾兑盈利: 24,
  }, */
  /* {
    确认时间: "2022-06-14",
    无手续费天数: 7,

    买入金额: 1024,
    确认份额: 1058.84,
    确认净值: 0.9671,

    勾兑金额: 1070,
    勾兑份额: 1058,
    勾兑净值: 1.0114,
    勾兑日期: "2022-06-15",
    勾兑盈利: 46,
  }, */
  /* {
    确认时间: "2022-06-22",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1008.06,
    确认净值: 0.9920,

    勾兑金额: 1016,
    勾兑份额: 1008,
    勾兑净值: 1.0088,
    勾兑日期: "2022-06-23",
    勾兑盈利: 16,
  }, */
  /* {
    确认时间: "2022-06-30",
    无手续费天数: 7,

    买入金额: 2000,
    确认份额: 2003,
    确认净值: 0.9983,

    勾兑金额: 2015.82,
    勾兑份额: 2003,
    勾兑净值: 1.0064,
    勾兑日期: "2022-07-01",
    勾兑盈利: 15,
  }, */
  /* {
    确认时间: "2022-07-18",
    无手续费天数: 7,

    买入金额: 2000,
    确认份额: 2156.33,
    确认净值: 0.9275,

    勾兑金额: 2045,
    勾兑份额: 2156,
    勾兑净值: 0.9486,
    勾兑日期: "2022-07-19",
    勾兑盈利: 45,
  },
  {
    确认时间: "2022-07-25",
    无手续费天数: 7,

    买入金额: 2045,
    确认份额: 2180.64,
    确认净值: 0.9378,

    勾兑金额: 2054,
    勾兑份额: 2180,
    勾兑净值: 0.9425,
    勾兑日期: "2022-07-27",
    勾兑盈利: 9,
  }, */
  /* {
    确认时间: "2022-08-04",
    无手续费天数: 7,

    买入金额: 4000,
    确认份额: 4454.34,
    确认净值: 0.8980,

    勾兑金额: 4035,
    勾兑份额: 4454,
    勾兑净值: 0.9061,
    勾兑日期: "2022-08-05",
    勾兑盈利: 35,
  }, */
  /* {
    确认时间: "2022-07-12",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1044.06,
    确认净值: 0.9578,

    勾兑金额: 1011,
    勾兑份额: 1044,
    勾兑净值: 0.9685,
    勾兑日期: "2022-08-12",
    勾兑盈利: 11,
  },
  {
    确认时间: "2022-08-01",
    无手续费天数: 7,

    买入金额: 2054,
    确认份额: 2186.97,
    确认净值: 0.9392,

    勾兑金额: 2117,
    勾兑份额: 2186,
    勾兑净值: 0.9685,
    勾兑日期: "2022-08-12",
    勾兑盈利: 63,
  },
  {
    确认时间: "2022-08-02",
    无手续费天数: 7,

    买入金额: 3000,
    确认份额: 3223.38,
    确认净值: 0.9307,

    勾兑金额: 3121,
    勾兑份额: 3223,
    勾兑净值: 0.9685,
    勾兑日期: "2022-08-12",
    勾兑盈利: 121,
  }, */
  /* {
    确认时间: "2022-09-30",
    无手续费天数: 7,

    买入金额: 2000,
    确认份额: 2347.42,
    确认净值: 0.8520,

    勾兑金额: 2038,
    勾兑份额: 2347,
    勾兑净值: 0.8686,
    勾兑日期: "2022-10-13",
    勾兑盈利: 38,
  },
  {
    确认时间: "2022-10-11",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1188.27,
    确认净值: 0.8424,

    勾兑金额: 1031,
    勾兑份额: 1188,
    勾兑净值: 0.8686,
    勾兑日期: "2022-10-13",
    勾兑盈利: 31,
  }, */
  /* {
    确认时间: "2022-10-27",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1175.50,
    确认净值: 0.8507,

    勾兑金额: 1004,
    勾兑份额: 1175,
    勾兑净值: 0.8548,
    勾兑日期: "2022-10-28",
    勾兑盈利: 4,
  }, */
  /* {
    确认时间: "2022-10-31",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1197.32,
    确认净值: 0.8352,

    勾兑金额: 1032,
    勾兑份额: 1197,
    勾兑净值: 0.8628,
    勾兑日期: "2022-11-02",
    勾兑盈利: 32,
  },
  {
    确认时间: "2022-10-31",
    无手续费天数: 7,

    买入金额: 2000,
    确认份额: 2394.64,
    确认净值: 0.8352,

    勾兑金额: 2065,
    勾兑份额: 2394,
    勾兑净值: 0.8628,
    勾兑日期: "2022-11-02",
    勾兑盈利: 65,
  }, */
  /* {
    确认时间: "2022-09-20",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1120.95,
    确认净值: 0.8921,

    勾兑金额: 1010,
    勾兑份额: 1120,
    勾兑净值: 0.9021,
    勾兑日期: "2022-11-14",
    勾兑盈利: 10,
  }, */
  /* {
    确认时间: "2022-09-16",
    无手续费天数: 7,

    买入金额: 6000,
    确认份额: 6660.01,
    确认净值: 0.9009,

    勾兑金额: 6046,
    勾兑份额: 6660,
    勾兑净值: 0.9079,
    勾兑日期: "2022-11-14",
    勾兑盈利: 46,
  }, */
  /* {
    确认时间: "2022-11-25",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1111.36,
    确认净值: 0.8998,

    勾兑金额: 1009.45,
    勾兑份额: 1111,
    勾兑净值: 0.9086,
    勾兑日期: "2022-11-28",
    勾兑盈利: 9,
  }, */
  /*  {
     确认时间: "2022-11-29",
     无手续费天数: 7,
 
     买入金额: 1000,
     确认份额: 1117.69,
     确认净值: 0.8947,
 
     勾兑金额: 1036.58,
     勾兑份额: 1117,
     勾兑净值: 0.9280,
     勾兑日期: "2022-11-30",
     勾兑盈利: 36,
   },
   {
     确认时间: "2022-11-29",
     无手续费天数: 7,
 
     买入金额: 1001,
     确认份额: 1118.81,
     确认净值: 0.8947,
 
     勾兑金额: 1037,
     勾兑份额: 1118,
     勾兑净值: 0.9280,
     勾兑日期: "2022-11-30",
     勾兑盈利: 36,
   }, */
  /* {
    确认时间: "2022-12-12",
    无手续费天数: 7,

    买入金额: 1001,
    确认份额: 1079.36,
    确认净值: 0.9274,

    勾兑金额: 1009,
    勾兑份额: 1079,
    勾兑净值: 0.9357,
    勾兑日期: "2022-12-14",
    勾兑盈利: 8,
  }, */
  /* {
    确认时间: "2022-12-20",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1114.83,
    确认净值: 0.8970,

    勾兑金额: 1001,
    勾兑份额: 1114,
    勾兑净值: 0.8993,
    勾兑日期: "2022-01-04",
    勾兑盈利: 1,
  },
  {
    确认时间: "2023-01-03",
    无手续费天数: 7,

    买入金额: 1001,
    确认份额: 1116.81,
    确认净值: 0.8963,

    勾兑金额: 1116,
    勾兑份额: 1003.62,
    勾兑净值: 0.8993,
    勾兑日期: "2023-01-04",
    勾兑盈利: 2,
  }, */
  /* {
    确认时间: "2022-12-19",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1109.14,
    确认净值: 0.9016,

    勾兑金额: 1016,
    勾兑份额: 1109,
    勾兑净值: 0.9163,
    勾兑日期: "2023-01-05",
    勾兑盈利: 16,
  },
  {
    确认时间: "2022-12-19",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1109.14,
    确认净值: 0.9016,

    勾兑金额: 1016,
    勾兑份额: 1109,
    勾兑净值: 0.9163,
    勾兑日期: "2023-01-05",
    勾兑盈利: 16,
  },
  {
    确认时间: "2023-01-04",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1111.98,
    确认净值: 0.8993,

    勾兑金额: 1018,
    勾兑份额: 1111,
    勾兑净值: 0.9163,
    勾兑日期: "2023-01-05",
    勾兑盈利: 18,
  },
  {
    确认时间: "2023-01-04",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1111.98,
    确认净值: 0.8993,

    勾兑金额: 1018,
    勾兑份额: 1111,
    勾兑净值: 0.9163,
    勾兑日期: "2023-01-05",
    勾兑盈利: 18,
  }, */
  /* {
    确认时间: "2022-12-15",
    无手续费天数: 7,

    买入金额: 1009,
    确认份额: 1088.81,
    确认净值: 0.9267,

    勾兑金额: 1013,
    勾兑份额: 1088,
    勾兑净值: 0.9315,
    勾兑日期: "2023-01-09",
    勾兑盈利: 4,
  }, */
  /* {
    确认时间: "2022-07-11",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1034.02,
    确认净值: 0.9671,

    勾兑金额: 1012,
    勾兑份额: 1034,
    勾兑净值: 0.9793,
    勾兑日期: "2023-01-16",
    勾兑盈利: 12,
  },
  {
    确认时间: "2022-09-15",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1048.44,
    确认净值: 0.9538,

    勾兑金额: 1026,
    勾兑份额: 1048,
    勾兑净值: 0.9793,
    勾兑日期: "2023-01-16",
    勾兑盈利: 26,
  }, */
  /* {
    确认时间: "2022-07-04",
    无手续费天数: 7,

    买入金额: 2000,
    确认份额: 2011.26,
    确认净值: 0.9944,

    勾兑金额: 2022,
    勾兑份额: 2011,
    勾兑净值: 1.0057,
    勾兑日期: "2023-01-19",
    勾兑盈利: 22,
  },
  {
    确认时间: "2022-07-06",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1012.97,
    确认净值: 0.9872,

    勾兑金额: 1017,
    勾兑份额: 1012,
    勾兑净值: 1.0057,
    勾兑日期: "2023-01-19",
    勾兑盈利: 17,
  }, */
  /* {
    确认时间: "2022-07-07",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1023.12,
    确认净值: 0.9774,

    勾兑金额: 1012,
    勾兑份额: 1023,
    勾兑净值: 0.9902,
    勾兑日期: "2023-01-17",
    勾兑盈利: 12,
  }, */

  /* {
    确认时间: "2022-02-16",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1046.24,
    确认净值: 0.9558,

    勾兑金额: 1024,
    勾兑份额: 1046,
    勾兑净值: 0.9799,
    勾兑日期: "2023-02-22",
    勾兑盈利: 24,
  }, */
  /* {
    确认时间: "2023-03-08",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1058.54,
    确认净值: 0.9447,

    勾兑金额: 1029,
    勾兑份额: 1058,
    勾兑净值: 0.9735,
    勾兑日期: "2023-04-04",
    勾兑盈利: 29,
  }, */
  /* {
    确认时间: "2022-04-26",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1069.63,
    确认净值: 0.9349,

    勾兑金额: 1036,
    勾兑份额: 1069,
    勾兑净值: 0.9694,
    勾兑日期: "20230504",
    勾兑盈利: 36,
  }, */
  /* {
    确认时间: "2022-05-25",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1076.19,
    确认净值: 0.9292,

    勾兑金额: 1002.29,
    勾兑份额: 1076,
    勾兑净值: 0.9315,
    勾兑日期: "2022-06-15",
    勾兑盈利: 2,
  },
  {
    确认时间: "2022-05-31",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1083.89,
    确认净值: 0.9226,

    勾兑金额: 1001.56,
    勾兑份额: 1083,
    勾兑净值: 0.9248,
    勾兑日期: "2023-06-09",
    勾兑盈利: 1,
  }, */
  /* {
    确认时间: "2022-06-26",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1124.48,
    确认净值: 0.8893,

    勾兑金额: 1008.23,
    勾兑份额: 1124,
    勾兑净值: 0.8970,
    勾兑日期: "",
    勾兑盈利: 8,
  }, */
  /* {
    确认时间: "2023-06-21",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1100.59,
    确认净值: 0.9086,

    勾兑金额: 1014,
    勾兑份额: 1100,
    勾兑净值: 0.9223,
    勾兑日期: "2023-07-04",
    勾兑盈利: 14,
  }, */
  /* {
    确认时间: "2023-06-08",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1081.31,
    确认净值: 0.9248,

    勾兑金额: 1010,
    勾兑份额: 1081,
    勾兑净值: 0.9346,
    勾兑日期: "2023-07-14",
    勾兑盈利: 10,
  }, */
  /* {
    确认时间: "2022-03-08",
    无手续费天数: 7,

    买入金额: 2000,
    确认份额: 1962.7,
    确认净值: 1.0190,

    勾兑金额: 2048.52,
    勾兑份额: 1962,
    勾兑净值: 1.0441,
    勾兑日期: "2023-08-01",
    勾兑盈利: 48,
  }, */
  /* {
    确认时间: "2022-02-16", //买的时间;
    无手续费天数: 7, //无手续费要经过的时间;

    买入金额: 1000, //购入时总金额;
    确认份额: 913.65, //购入时总份额;
    确认净值: 1.0945, //购入时单位成本;

    勾兑金额: 1005, //卖出时总金额; 0表示没卖出对应份额;
    勾兑份额: 913, //卖出时总份额; 0表示没卖出对应份额;
    勾兑净值: 1.1017, //卖出时单位成本; 0表示没卖出对应份额;
    勾兑日期: "2023-08-11", //卖出时间; 空字符串表示没卖出;
    勾兑盈利: 5, //卖出与买入的对比; 0表示没卖出;
  }, */
];
