const 南方中评全指证券有效交易 = [
  {
    买入时间: "2023-08-15",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 954.11,
    确认净值: 1.0481,

    勾兑金额: 0,
    勾兑份额: 0,
    勾兑净值: 0,
    勾兑日期: "",
    勾兑盈利: 0,
  },
  {
    买入时间: "2023-10-16",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1040.04,
    确认净值: 0.9615,

    勾兑金额: 0,
    勾兑份额: 0,
    勾兑净值: 0,
    勾兑日期: "",
    勾兑盈利: 0,
  },
  {
    买入时间: "2023-10-20",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1031.89,
    确认净值: 0.9691,

    勾兑金额: 0,
    勾兑份额: 0,
    勾兑净值: 0,
    勾兑日期: "",
    勾兑盈利: 0,
  },
  {
    买入时间: "2023-10-20",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1031.89,
    确认净值: 0.9691,

    勾兑金额: 0,
    勾兑份额: 0,
    勾兑净值: 0,
    勾兑日期: "",
    勾兑盈利: 0,
  },
  {
    买入时间: "2023-10-23",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1055.52,
    确认净值: 0.9474,

    勾兑金额: 0,
    勾兑份额: 0,
    勾兑净值: 0,
    勾兑日期: "",
    勾兑盈利: 0,
  },
];
//交易说明:
/* 
[
  {
    买入时间: "2022-02-16", //买的时间;
    无手续费天数: 7, //无手续费要经过的时间;

    买入金额: 1000, //购入时总金额;
    确认份额: 913.65, //购入时总份额;
    确认净值: 1.0945, //购入时单位成本;

    勾兑金额: 0, //卖出时总金额; 0表示没卖出对应份额;
    勾兑份额: 0, //卖出时总份额; 0表示没卖出对应份额;
    勾兑净值: 0, //卖出时单位成本; 0表示没卖出对应份额;
    勾兑日期: "", //卖出时间; 空字符串表示没卖出;
    勾兑盈利: 0, //卖出与买入的对比; 0表示没卖出;
  },
]

*/


//做波段高频无手续费交易:
//如果`当天净值`高于最低净值,并且其它的份额中`最低净值对应的确认份额`也过了`无手续费天数`;可以直接买出`最低净值对应的确认份额`,并标注那一份最低的确认份额对应卖出;
//之后在`最低净值对应的勾兑净值`标注为`当天净值`;在后面如果`当天净值`高于`最低净值对应的勾兑净值`时,可以买入;(中间的差值就表示自己赚了多少);
//前提:每一次的买入都代表自己认为长期时,净值一定会超过此时买入的净值;
//结论:也就是在说在`每一天的当天净值`位于[`最低净值对应的勾兑净值`,`第二低净值`]时,不可买入和卖出,因为这代表上次交易出错了(不过短期内不代表亏损,长期来看才是亏本的),此时最好就是等时间;

const 南方中评全指证券已勾兑交易 = [
  /* {
    买入时间: "2023-10-23",
    无手续费天数: 7,

    买入金额: 1000,
    确认份额: 1055.52,
    确认净值: 0.9474,

    勾兑金额: 1029,
    勾兑份额: 1055,
    勾兑净值: 0.9756,
    勾兑日期: "2023-10-24",
    勾兑盈利: 29,
  }, */
];
